GopalSaraf/Practicals/PSDL/include/proc/pic18f05q41.h
extern volatile SPI2CLKbits_t SPI2CLKbits __at(0x099);
// bitfield macros
#define _SPI2CLK_CLKSEL_POSN                                0x0
#define _SPI2CLK_CLKSEL_POSITION                            0x0
#define _SPI2CLK_CLKSEL_SIZE                                0x8
#define _SPI2CLK_CLKSEL_LENGTH                              0x8
#define _SPI2CLK_CLKSEL_MASK                                0xFF
#define _SPI2CLK_CLKSEL0_POSN                               0x0
#define _SPI2CLK_CLKSEL0_POSITION                           0x0
#define _SPI2CLK_CLKSEL0_SIZE                               0x1
#define _SPI2CLK_CLKSEL0_LENGTH                             0x1
#define _SPI2CLK_CLKSEL0_MASK                               0x1
#define _SPI2CLK_CLKSEL1_POSN                               0x1
#define _SPI2CLK_CLKSEL1_POSITION                           0x1
#define _SPI2CLK_CLKSEL1_SIZE                               0x1
#define _SPI2CLK_CLKSEL1_LENGTH                             0x1
#define _SPI2CLK_CLKSEL1_MASK                               0x2
#define _SPI2CLK_CLKSEL2_POSN                               0x2
#define _SPI2CLK_CLKSEL2_POSITION                           0x2
#define _SPI2CLK_CLKSEL2_SIZE                               0x1
#define _SPI2CLK_CLKSEL2_LENGTH                             0x1
#define _SPI2CLK_CLKSEL2_MASK                               0x4
#define _SPI2CLK_CLKSEL3_POSN                               0x3
#define _SPI2CLK_CLKSEL3_POSITION                           0x3
#define _SPI2CLK_CLKSEL3_SIZE                               0x1
#define _SPI2CLK_CLKSEL3_LENGTH                             0x1
#define _SPI2CLK_CLKSEL3_MASK                               0x8
#define _SPI2CLK_SPI2CLKSEL_POSN                            0x0
#define _SPI2CLK_SPI2CLKSEL_POSITION                        0x0
#define _SPI2CLK_SPI2CLKSEL_SIZE                            0x8
#define _SPI2CLK_SPI2CLKSEL_LENGTH                          0x8
#define _SPI2CLK_SPI2CLKSEL_MASK                            0xFF
#define _SPI2CLK_SPI2CLKSEL0_POSN                           0x0
#define _SPI2CLK_SPI2CLKSEL0_POSITION                       0x0
#define _SPI2CLK_SPI2CLKSEL0_SIZE                           0x1
#define _SPI2CLK_SPI2CLKSEL0_LENGTH                         0x1
#define _SPI2CLK_SPI2CLKSEL0_MASK                           0x1
#define _SPI2CLK_SPI2CLKSEL1_POSN                           0x1
#define _SPI2CLK_SPI2CLKSEL1_POSITION                       0x1
#define _SPI2CLK_SPI2CLKSEL1_SIZE                           0x1
#define _SPI2CLK_SPI2CLKSEL1_LENGTH                         0x1
#define _SPI2CLK_SPI2CLKSEL1_MASK                           0x2
#define _SPI2CLK_SPI2CLKSEL2_POSN                           0x2
#define _SPI2CLK_SPI2CLKSEL2_POSITION                       0x2
#define _SPI2CLK_SPI2CLKSEL2_SIZE                           0x1
#define _SPI2CLK_SPI2CLKSEL2_LENGTH                         0x1
#define _SPI2CLK_SPI2CLKSEL2_MASK                           0x4
#define _SPI2CLK_SPI2CLKSEL3_POSN                           0x3
#define _SPI2CLK_SPI2CLKSEL3_POSITION                       0x3
#define _SPI2CLK_SPI2CLKSEL3_SIZE                           0x1
#define _SPI2CLK_SPI2CLKSEL3_LENGTH                         0x1
#define _SPI2CLK_SPI2CLKSEL3_MASK                           0x8

// Register: DAC2DAT
#define DAC2DAT DAC2DAT
extern volatile unsigned char           DAC2DAT             __at(0x0A0);
#ifndef _LIB_BUILD
asm("DAC2DAT equ 0A0h");
#endif

// Register: DAC2DATL
#define DAC2DATL DAC2DATL
extern volatile unsigned char           DAC2DATL            __at(0x0A0);
#ifndef _LIB_BUILD
asm("DAC2DATL equ 0A0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC2R                  :8;
    };
    struct {
        unsigned DAC2R0                 :1;
        unsigned DAC2R1                 :1;
        unsigned DAC2R2                 :1;
        unsigned DAC2R3                 :1;
        unsigned DAC2R4                 :1;
        unsigned DAC2R5                 :1;
        unsigned DAC2R6                 :1;
        unsigned DAC2R7                 :1;
    };
    struct {
        unsigned DAC2RL                 :8;
    };
} DAC2DATLbits_t;
extern volatile DAC2DATLbits_t DAC2DATLbits __at(0x0A0);
// bitfield macros
#define _DAC2DATL_DAC2R_POSN                                0x0
#define _DAC2DATL_DAC2R_POSITION                            0x0
#define _DAC2DATL_DAC2R_SIZE                                0x8
#define _DAC2DATL_DAC2R_LENGTH                              0x8
#define _DAC2DATL_DAC2R_MASK                                0xFF
#define _DAC2DATL_DAC2R0_POSN                               0x0
#define _DAC2DATL_DAC2R0_POSITION                           0x0
#define _DAC2DATL_DAC2R0_SIZE                               0x1
#define _DAC2DATL_DAC2R0_LENGTH                             0x1
#define _DAC2DATL_DAC2R0_MASK                               0x1
#define _DAC2DATL_DAC2R1_POSN                               0x1
#define _DAC2DATL_DAC2R1_POSITION                           0x1
#define _DAC2DATL_DAC2R1_SIZE                               0x1
#define _DAC2DATL_DAC2R1_LENGTH                             0x1
#define _DAC2DATL_DAC2R1_MASK                               0x2
#define _DAC2DATL_DAC2R2_POSN                               0x2
#define _DAC2DATL_DAC2R2_POSITION                           0x2
#define _DAC2DATL_DAC2R2_SIZE                               0x1
#define _DAC2DATL_DAC2R2_LENGTH                             0x1
#define _DAC2DATL_DAC2R2_MASK                               0x4
#define _DAC2DATL_DAC2R3_POSN                               0x3
#define _DAC2DATL_DAC2R3_POSITION                           0x3
#define _DAC2DATL_DAC2R3_SIZE                               0x1
#define _DAC2DATL_DAC2R3_LENGTH                             0x1
#define _DAC2DATL_DAC2R3_MASK                               0x8
#define _DAC2DATL_DAC2R4_POSN                               0x4
#define _DAC2DATL_DAC2R4_POSITION                           0x4
#define _DAC2DATL_DAC2R4_SIZE                               0x1
#define _DAC2DATL_DAC2R4_LENGTH                             0x1
#define _DAC2DATL_DAC2R4_MASK                               0x10
#define _DAC2DATL_DAC2R5_POSN                               0x5
#define _DAC2DATL_DAC2R5_POSITION                           0x5
#define _DAC2DATL_DAC2R5_SIZE                               0x1
#define _DAC2DATL_DAC2R5_LENGTH                             0x1
#define _DAC2DATL_DAC2R5_MASK                               0x20
#define _DAC2DATL_DAC2R6_POSN                               0x6
#define _DAC2DATL_DAC2R6_POSITION                           0x6
#define _DAC2DATL_DAC2R6_SIZE                               0x1
#define _DAC2DATL_DAC2R6_LENGTH                             0x1
#define _DAC2DATL_DAC2R6_MASK                               0x40
#define _DAC2DATL_DAC2R7_POSN                               0x7
#define _DAC2DATL_DAC2R7_POSITION                           0x7
#define _DAC2DATL_DAC2R7_SIZE                               0x1
#define _DAC2DATL_DAC2R7_LENGTH                             0x1
#define _DAC2DATL_DAC2R7_MASK                               0x80
#define _DAC2DATL_DAC2RL_POSN                               0x0
#define _DAC2DATL_DAC2RL_POSITION                           0x0
#define _DAC2DATL_DAC2RL_SIZE                               0x8
#define _DAC2DATL_DAC2RL_LENGTH                             0x8
#define _DAC2DATL_DAC2RL_MASK                               0xFF

// Register: DAC2CON
#define DAC2CON DAC2CON
extern volatile unsigned char           DAC2CON             __at(0x0A2);
#ifndef _LIB_BUILD
asm("DAC2CON equ 0A2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned                        :3;
        unsigned EN                     :1;
    };
    struct {
        unsigned DAC2NSS                :2;
        unsigned DAC2PSS0               :1;
        unsigned DAC2PSS1               :1;
        unsigned                        :3;
        unsigned DAC2EN                 :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned                        :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
    };
} DAC2CONbits_t;
extern volatile DAC2CONbits_t DAC2CONbits __at(0x0A2);
// bitfield macros
#define _DAC2CON_NSS_POSN                                   0x0
#define _DAC2CON_NSS_POSITION                               0x0
#define _DAC2CON_NSS_SIZE                                   0x2
#define _DAC2CON_NSS_LENGTH                                 0x2
#define _DAC2CON_NSS_MASK                                   0x3
#define _DAC2CON_PSS_POSN                                   0x2
#define _DAC2CON_PSS_POSITION                               0x2
#define _DAC2CON_PSS_SIZE                                   0x2
#define _DAC2CON_PSS_LENGTH                                 0x2
#define _DAC2CON_PSS_MASK                                   0xC
#define _DAC2CON_EN_POSN                                    0x7
#define _DAC2CON_EN_POSITION                                0x7
#define _DAC2CON_EN_SIZE                                    0x1
#define _DAC2CON_EN_LENGTH                                  0x1
#define _DAC2CON_EN_MASK                                    0x80
#define _DAC2CON_DAC2NSS_POSN                               0x0
#define _DAC2CON_DAC2NSS_POSITION                           0x0
#define _DAC2CON_DAC2NSS_SIZE                               0x2
#define _DAC2CON_DAC2NSS_LENGTH                             0x2
#define _DAC2CON_DAC2NSS_MASK                               0x3
#define _DAC2CON_DAC2PSS0_POSN                              0x2
#define _DAC2CON_DAC2PSS0_POSITION                          0x2
#define _DAC2CON_DAC2PSS0_SIZE                              0x1
#define _DAC2CON_DAC2PSS0_LENGTH                            0x1
#define _DAC2CON_DAC2PSS0_MASK                              0x4
#define _DAC2CON_DAC2PSS1_POSN                              0x3
#define _DAC2CON_DAC2PSS1_POSITION                          0x3
#define _DAC2CON_DAC2PSS1_SIZE                              0x1
#define _DAC2CON_DAC2PSS1_LENGTH                            0x1
#define _DAC2CON_DAC2PSS1_MASK                              0x8
#define _DAC2CON_DAC2EN_POSN                                0x7
#define _DAC2CON_DAC2EN_POSITION                            0x7
#define _DAC2CON_DAC2EN_SIZE                                0x1
#define _DAC2CON_DAC2EN_LENGTH                              0x1
#define _DAC2CON_DAC2EN_MASK                                0x80
#define _DAC2CON_NSS0_POSN                                  0x0
#define _DAC2CON_NSS0_POSITION                              0x0
#define _DAC2CON_NSS0_SIZE                                  0x1
#define _DAC2CON_NSS0_LENGTH                                0x1
#define _DAC2CON_NSS0_MASK                                  0x1
#define _DAC2CON_PSS0_POSN                                  0x2
#define _DAC2CON_PSS0_POSITION                              0x2
#define _DAC2CON_PSS0_SIZE                                  0x1
#define _DAC2CON_PSS0_LENGTH                                0x1
#define _DAC2CON_PSS0_MASK                                  0x4
#define _DAC2CON_PSS1_POSN                                  0x3
#define _DAC2CON_PSS1_POSITION                              0x3
#define _DAC2CON_PSS1_SIZE                                  0x1
#define _DAC2CON_PSS1_LENGTH                                0x1
#define _DAC2CON_PSS1_MASK                                  0x8

